#include<stdio.h>
/*企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，
高于10万元的部分，可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于 40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%，高于 100万元时，超过100万元的部分按1%提成，
从键盘输入当月利润I，求应发放奖金总数？ */
int main()
{
	printf("please enter your profit :");
	double p;
	scanf_s("%lf", &p);
	if (p < 10)
	{
		printf("%5.2lf\n", p * 0.1);
	}
	else if (p < 20)
	{
		printf("%5.2lf\n", 10 * 0.1 + (p - 10) * 0.075);
	}
	else if (p < 40)
	{
		printf("%5.2lf\n", 10 * 0.1 + 20 *0.075 + (p - 20) * 0.05);
	}
	else if (p < 60)
	{
		printf("%5.2lf\n", 10 * 0.1 + 20 * 0.075 + 40 * 0.05 + (p - 40) * 0.03);
	}
	else if (p < 100)
	{
		printf("%5.2lf\n", 10 * 0.1 + 20 * 0.075 + 40 * 0.05 + 60 * 0.03 + (p - 60) * 0.015);
	}
	else
	{
		printf("%5.2lf\n", 10 * 0.1 + 20 * 0.075 + 40 * 0.05 + 60 * 0.03 + 100 * 0.015 + (p - 100) * 0.01);
	}
	return 0;
}